#!/bin/sh
# 1. Добавяне на текст с Име и е-поща в средата горе на всяка страница.
# $1 имена и поща: "За Перко Наумов <perko@abv.bg>"
# $2 настройки за текста: "font:Pliska-Italic, points:9, off:0 -30, sc:1.0 abs, pos:tc, rot:0"
# $3 местонахождение на файла източник: Истсоф-2023-06-09-print2.pdf
# $4 местонахождение на произведения файл: Истсоф-2023-06-09-print2-stamp.pdf  
pdfcpu stamp add -mode text -- "$1" "$2" "$3" "$4"
# 2. Криптиране на файла и добавяне на пароли за отваряне. Трябва да се сложат
# две (еднакви) пароли една за собственик и една за потребител. Не може само
# потребителска парола, а ако се сложи само собственическа, документът се
# отваря без да изисква въвеждане на парола. Когато не е подаден изходен файл,
# файлът бива криптиран на място. Не се създава нов файл.
# $5 пароли за криптирания файл: ALABALA
pdfcpu encrypt -opw "$5" -upw "$5" "$4"
